# Задача 8: Требуется определить, можно ли от шоколадки размером n
# × m долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes
# 3 2 1 -> no

a = int(input("Введите длину шоколадки: "))
b = int(input("Введите ширину шоколадки: "))
c = int(input(" Введите кол-во долек: "))

if a*b/2 < c and c <= a*b:
    print("yes")
else:
    print('no')